tap "adoptopenjdk/openjdk"
tap "bramstein/webfonttools"
tap "federico-terzi/espanso"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"

brew "bat" 													# cat, but with syntax highlighting
brew "ack" 													# Search tool like grep, but optimized for programmers
brew "adns" 												# C/C++ resolver library and DNS resolver utilities
brew "awscli" 												# Official Amazon AWS command-line interface
brew "bandwhich" 											# Terminal bandwidth utilization tool
brew "coreutils" 											# GNU File, Shell and Text utilities
brew "curl" 												# Command line tool for transferring data with URL syntax
brew "httpie"												# httpie is a CLI, cURL-like tool for humans.
brew "diff-so-fancy" 										# Good-lookin' diffs with diff-highlight and more
brew "exa" 													# Modern replacement for ls
brew "fd" 													# A simple, fast and user-friendly alternative to find
brew "zimg" 												# Image format converter
brew "ffmpeg" 												# A complete, cross-platform solution to record, convert and stream audio and video
brew "findutils"  											# GNU find, locate, updatedb, and xargs utilities
brew "folly" 												# C++14 compatible library for modern C++
brew "git" 													
brew "git-crypt" 											# Encrypt and decrypt files inside a git repository
brew "git-extras" 											# Extra Git features
brew "git-lfs" 												# Large File Support for Git
brew "gnu-sed" 												# GNU implementation of the famous stream editor
brew "gnupg" 												# GNU Privacy Guard: a free PGP replacement
brew "highlight" 											# Syntax highlighting for command line editing
brew "htop" 												# Improved top (interactive process viewer)
brew "hyperfine" 											# A command line utility for benchmarking
brew "jansson" 												# C library for encoding, decoding, and manipulating JSON
brew "jenv" 												# Java version manager
brew "pango" 												# Library for laying out and rendering text
brew "librsvg" 												# Library to render SVG files using Cairo
brew "luajit" 												# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luarocks" 											# Lua module manager
brew "lynx" 												# Text-based web browser
brew "maven" 												# Java-based project management and packaging
brew "moreutils" 											# Collection of the UNIX tools
brew "mysql" 												# MySQL database server
brew "postgresql" 											# PostgreSQL database server
brew "neofetch" 											# A CLI tool to see information about your system
brew "ngrep" 												# Network grep
brew "nmap" 												# Network scanner
brew "onefetch" 											# Git repository summary on your terminal
brew "openconnect" 											# OpenVPN client
brew "pandoc" 												# Command-line utility to convert between markup formats
brew "php" 													# A popular general-purpose scripting language
brew "pinentry-mac" 										# A graphical password entry dialog
brew "pv" 													# Monitor data passing through a filter
brew "rename" 												# Perl-powered file rename script with many helpful built-ins
brew "rust" 												# A system for writing safe, portable and efficient software
brew "ssh-copy-id" 											# Copy SSH public keys to clipboard
brew "telnet" 												# A terminal emulator for the TELNET protocol
brew "tokei" 												# A terminal-based code metrics tool
brew "tree" 												# Display directories as trees (with optional color/HTML output)
brew "watchman" 											# Watch files and take action when they change
brew "watson" 												# Command-line tool to track (your) time
brew "webkit2png" 											# Create screenshots of webpages from the terminal
brew "wget" 												# A command line tool to retrieve files from the web
brew "woff2" 												# Utilities to create and convert Web Open Font File (WOFF) files
brew "z" 													# Tracks most-used directories to make cd smarter
brew "zopfli" 												# Fast lossless compression utility
brew "zsh-history-substring-search" 						# Search your zsh history with a substring
brew "federico-terzi/espanso/espanso" 						# Cross-platform Text Expander written in Rust
brew "fzf" 													# A command-line fuzzy finder
brew "starship"												# The minimal, blazing-fast, and infinitely customizable prompt for any shell!
brew "neovim"												# Neovim is a text editor focused on extensibility and agility
brew "n"													# node version manager
brew "yarn"  												# Yarn is a package manager for Node.js
brew "tmux"  												# Tmux is a terminal multiplexer
brew "tmuxp"  												# Tmux session manager
brew "imagemagick"  										# ImageMagick is a software suite to create, edit, compose, or convert bitmap images
brew "muffet" 												# website link checker which scrapes and inspects all pages in a website recursively
brew "jrnl" 												# jrnl is a simple, fast, and powerful command-line note taking tool
brew "reattach-to-user-namespace"							# Reattach process (e.g., tmux) to background
brew "cataclysm"							                # 

cask "adoptopenjdk13", args: { appdir: "~/Applications" }   # Java Development Kit
cask "android-platform-tools" 								# Android SDK Platform-Tools
cask "betterzip", args: { appdir: "~/Applications" } 		# BetterZip is a GUI for 7-Zip
cask "joshjon-nocturnal" 									# Nocturnal is a dark theme for macOS
cask "mediainfo"											# MediaInfo is a free and open-source utility for gathering technical metadata of multimedia files
cask "ngrok" 												# ngrok is a free, open-source, secure tunneling service
cask "anki"													# Anki is a free, open-source, cross-platform flashcard application
cask "open-in-code" 										# Open in Code is a finder addon to open selected file/directory in the VS Code
cask "1password" 											# password manager
cask "charles"												# Charles is a network protocol analyzer
cask "devutils"												# Offline toolbox for developers
cask "dropbox" 												# Dropbox is a cloud storage service
cask "geogebra"												# Solve, save and share math problems, graph functions, etc
cask "iina" 												# video player
cask "iterm2"												# iTerm2 is a terminal emulator
cask "warp"													# Rust-based terminal
cask "mathpix-snipping-tool" 								# Scanner app for math and science
cask "obsidian" 											# Knowledge base that works on top of a local folder of plain text Markdown files
cask "postman" 												# Collaboration platform for API development
cask "spotify"
cask "slack"
cask "sketch"
cask "affinity-designer"
cask "raindropio"
cask "visual-studio-code"
cask "webstorm"
cask "intellij-idea"
cask "viber"
cask "zoom"
cask "alfred"
cask "lulu"
cask "expressvpn"
cask "steam"
cask "suspicious-package", args: { appdir: "~/Applications" }
cask "the-unarchiver", args: { appdir: "~/Applications" }   # Unarchiver is a free utility for extracting archives
cask "transmission", args: { appdir: "~/Applications" }     # Transmission is a bittorrent client
# cask "flying-carpet" 										# cross platform file transfer over ad-hoc wifi
# cask "mongodb-compass"
# cask "grammarly"
# cask "sloth"
# ## Install Fonts
cask "font-iosevka"
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# ## Install developer friendly quick look plugins; see https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode", args: { appdir: "~/Applications" }
cask "qlimagesize", args: { appdir: "~/Applications" }
cask "qlmarkdown", args: { appdir: "~/Applications" }
cask "qlprettypatch", args: { appdir: "~/Applications" }
cask "qlstephen", args: { appdir: "~/Applications" }
cask "qlvideo", args: { appdir: "~/Applications" }
cask "quicklook-csv", args: { appdir: "~/Applications" }
cask "quicklook-json", args: { appdir: "~/Applications" }
cask "quicklookase", args: { appdir: "~/Applications" }
cask "webpquicklook", args: { appdir: "~/Applications" }
